{
  "auto_mapping": null,
  "base_model_name_or_path": "distilbert-base-uncased",
  "exclude_modules": null,
  "fan_in_fan_out": false,
  "feedforward_modules": [
    "lin2",
    "lin1"
  ],
  "inference_mode": true,
  "init_ia3_weights": true,
  "modules_to_save": [
    "qa_outputs"
  ],
  "peft_type": "IA3",
  "revision": null,
  "target_modules": [
    "q_lin",
    "out_lin",
    "k_lin",
    "v_lin",
    "lin1",
    "lin2"
  ],
  "task_type": "QUESTION_ANS"
}